USE UNIVER;
GO

INSERT INTO STUDENT(IDGROUP, NAME, BDAY, INFO)
VALUES(4, 'юпжшунбхв о.ю.', '2004-01-28',
'<ярсдемр>
<оюяонпр яепхъ="цп" мнлеп="4245033" дюрю="2014-11-19" />
<рекетнм>+3753361896919</рекетнм>
<юдпея>
<ярпюмю>аекюпсяэ</ярпюмю>
<цнпнд>лхмяй</цнпнд>
<скхжю>аекнпсяяйюъ</скхжю>
<днл>33</днл>
<йбюпрхпю>11</йбюпрхпю>
</юдпея>
</ярсдемр>');
GO
SELECT * FROM STUDENT WHERE NAME = 'юпжшунбхв о.ю.'
GO
UPDATE STUDENT SET INFO =
'<ярсдемр>
<оюяонпр яепхъ="цп" мнлеп="41332033" дюрю="19.04.2013" />
<рекетнм>+375336185691</рекетнм>
<юдпея>
<ярпюмю>аекюпсяэ</ярпюмю>
<цнпнд>лхмяй</цнпнд>
<скхжю>аекнпсяяйюъ</скхжю>
<днл>4</днл>
<йбюпрхпю>5</йбюпрхпю>
</юдпея>
</ярсдемр>' WHERE NAME='юпжшунбхв о.ю.';
GO

SELECT NAME[тхн], INFO.value('(ярсдемр/оюяонпр/@яепхъ)[1]', 'CHAR(2)')[яепхъ оюяонпрю],
INFO.value('(ярсдемр/оюяонпр/@мнлеп)[1]', 'VARCHAR(20)')[мнлеп оюяонпрю],
INFO.query('/ярсдемр/юдпея')[юдпея]
FROM STUDENT
WHERE NAME = 'юпжшунбхв о.ю.';